In [1]:
l=[]
for i in range(1,101):
    l.append(i)
l

[1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 85,
 86,
 87,
 88,
 89,
 90,
 91,
 92,
 93,
 94,
 95,
 96,
 97,
 98,
 99,
 100]

In [2]:
for i in l:
    if i%2==0:
        print(i)

2
4
6
8
10
12
14
16
18
20
22
24
26
28
30
32
34
36
38
40
42
44
46
48
50
52
54
56
58
60
62
64
66
68
70
72
74
76
78
80
82
84
86
88
90
92
94
96
98
100

In [4]:
a = (1,2,3)
print(id(a))
a = (1,2)
print(id(a))

2333856222208
2333859941696

In [36]:
[i for i in l if i%2==0]

[2,
 4,
 6,
 8,
 10,
 12,
 14,
 16,
 18,
 20,
 22,
 24,
 26,
 28,
 30,
 32,
 34,
 36,
 38,
 40,
 42,
 44,
 46,
 48,
 50,
 52,
 54,
 56,
 58,
 60,
 62,
 64,
 66,
 68,
 70,
 72,
 74,
 76,
 78,
 80,
 82,
 84,
 86,
 88,
 90,
 92,
 94,
 96,
 98,
 100]

In [ ]:
### Write a python function to return the Nth fibonacci number

In [37]:
def fib(n):
    if n<=0:
        return 1
    else:
        return n*fib(n-1)
    
fib(5)

120

In [ ]:
a=[]

def fibo(n):
    if n==0:
        retun 0
    if n==1 or n==2:
        a[n]=1
        return a[n]
    if a[n]:
        return a[n]
    if (n and i):
        k = (n+1)//2
    else:
        k = n//2
    if ((n and i)):
        a[n] = (fibo(k) * fibo(k) + fib(k-1)*fib(k-1))
    else:
        a[n] = 2*fibo(k-1)

In [49]:
#We have a warehouse with shipments coming in and going out. The shipments are recorded in a transaction log with the item-id and the corresponding quantity being brought in or shipped out. 
#An example log is shown below:

transaction_log = """
Item1   10  
Item2 	  1    
Item1         -5          
Item3     40        
Item2    -1      
"""

a = transaction_log.split("Item ")
a[0].count(' ')
b = a[0].replace(" ",'')

In [54]:
#b = b.replace("\n","")
b = b.replace("\t","")

In [59]:
c = [i for i in b.split('Item'+i)]
c

['Item110Item21Item1-5Item340Item2-1']

In [ ]:
d = []
for i in c

In [31]:
for c in b:
    b.remove(c)

In [32]:
b

[]

In [61]:
a = (1,2,3)
print(id(a))
a = (1,2)
print(id(a))

2333897391872
2333901313856

In [64]:
import numpy as np

a = np.ones(2)
b = np.zeros((2,2))

In [70]:
a
c = b+1
c*2

array([[2., 2.],
       [2., 2.]])

In [72]:
a = np.arange(2,6,2)
a

array([2, 4])

In [76]:
a = np.array([[1,1],[2,2]])
a

array([[1, 1],
       [2, 2]])

In [78]:
a.diagonal()

array([1])

In [79]:
a

array([[1, 1],
       [2, 2]])

In [80]:
a.flatten()

array([1, 1, 2, 2])

In [83]:
newarr = a.reshape(1,4)
newarr

array([[1, 1, 2, 2]])

In [84]:
arr = np.array([[-1, 2, 0, 4],
                [4, -0.5, 6, 0],
                [2.6, 0, 7, 8],
                [3, -7, 4, 2.0]])

In [92]:
#Elements at indices (0, 3), (1, 2), (2, 1),"
                                    "(3, 0

array([[ 2. ],
       [-0.5]])

In [95]:
arr[0][3]
arr[1][2]

6.0

In [97]:
a = np.arange(1,6)
a

array([1, 2, 3, 4, 5])

In [98]:
a+1

array([2, 3, 4, 5, 6])

In [99]:
a-3

array([-2, -1,  0,  1,  2])

In [100]:
a*3

array([ 3,  6,  9, 12, 15])

In [101]:
a**2

array([ 1,  4,  9, 16, 25], dtype=int32)

In [105]:
a.max()
a.min()

1

In [106]:
a.sum()

15

In [107]:
a = np.array([[1,2],[3,4]])
b = np.array([[5,6],[7,8]])

#3 matrix multiplication:

a.dot(b)

array([[19, 22],
       [43, 50]])

In [108]:
values = [('Hrithik', 2009, 8.5), ('Ajay', 2008, 8.7), 
           ('Pankaj', 2008, 7.9), ('Aakash', 2009, 9.0)]

In [109]:
a = array(values,)

TypeError: 'str' object is not callable

In [110]:
A = np.array([[6, 1, 1],
              [4, -2, 5],
              [2, 8, 7]])

In [111]:
##  matrix rank

np.linalg.matrix_rank(A)

3

In [112]:
## TRACE

np.trace(A)

11

In [113]:
## det of a 

np.linalg.det(A)

-306.0

In [114]:
## inverse A

np.linalg.inv(A)

array([[ 0.17647059, -0.00326797, -0.02287582],
       [ 0.05882353, -0.13071895,  0.08496732],
       [-0.11764706,  0.1503268 ,  0.05228758]])

###let us assume that we want to solve this linear equation set:

x + 2*y = 8
3*x + 4*y = 18

In [116]:
a = np.array([[1,2],[3,4]])
b= np.array([8,18])

np.linalg.solve(a,b)

array([2., 3.])

In [131]:
## creating a black image

a = np.ones([100,100,3],dtype=np.uint8)
#a.fill#
a=a*255
a

array([[[255, 255, 255],
        [255, 255, 255],
        [255, 255, 255],
        ...,
        [255, 255, 255],
        [255, 255, 255],
        [255, 255, 255]],

       [[255, 255, 255],
        [255, 255, 255],
        [255, 255, 255],
        ...,
        [255, 255, 255],
        [255, 255, 255],
        [255, 255, 255]],

       [[255, 255, 255],
        [255, 255, 255],
        [255, 255, 255],
        ...,
        [255, 255, 255],
        [255, 255, 255],
        [255, 255, 255]],

       ...,

       [[255, 255, 255],
        [255, 255, 255],
        [255, 255, 255],
        ...,
        [255, 255, 255],
        [255, 255, 255],
        [255, 255, 255]],

       [[255, 255, 255],
        [255, 255, 255],
        [255, 255, 255],
        ...,
        [255, 255, 255],
        [255, 255, 255],
        [255, 255, 255]],

       [[255, 255, 255],
        [255, 255, 255],
        [255, 255, 255],
        ...,
        [255, 255, 255],
        [255, 255, 255],
        [255, 255, 255]]], dtype=uint8)

In [133]:
Dict = { 5 : 'Welcome', 6 : 'To', 7 : 'Geeks',
        'A' : {1 : 'Geeks', 2 : 'For', 3 : 'Geeks'},
        'B' : {1 : 'Geeks', 2 : 'Life'}}
print("Initial Dictionary: ")
print(Dict)

Initial Dictionary:
{5: 'Welcome', 6: 'To', 7: 'Geeks', 'A': {1: 'Geeks', 2: 'For', 3: 'Geeks'}, 'B': {1: 'Geeks', 2: 'Life'}}

In [135]:
del Dict[6]

In [136]:
Dict

{5: 'Welcome',
 7: 'Geeks',
 'A': {1: 'Geeks', 2: 'For', 3: 'Geeks'},
 'B': {1: 'Geeks', 2: 'Life'}}

In [138]:
Dict.update({1:'rohan'})

In [139]:
Dict

{5: 'Welcome',
 7: 'Geeks',
 'A': {1: 'Geeks', 2: 'For', 3: 'Geeks'},
 'B': {1: 'Geeks', 2: 'Life'},
 1: 'rohan'}

In [141]:
for x,y in Dict.items():
    print(f"{x}: {y}")

5: Welcome
7: Geeks
A: {1: 'Geeks', 2: 'For', 3: 'Geeks'}
B: {1: 'Geeks', 2: 'Life'}
1: rohan

In [144]:
a = [1,2,3,4]
b = [3,4,5,6]

c = dict(zip(a,b))
c

{1: 3, 2: 4, 3: 5, 4: 6}

In [147]:
s = "i have a good friend"
d = {}
for i in s:
    if i in d:
        d[i]=d[i]+1
    else:
        d[i]=1
        
d

{'i': 2,
 ' ': 4,
 'h': 1,
 'a': 2,
 'v': 1,
 'e': 2,
 'g': 1,
 'o': 2,
 'd': 2,
 'f': 1,
 'r': 1,
 'n': 1}

In [149]:
a = [1,2,3,4]
b = [3,4,5,6]
c=[]
for i in a:
    if i in b:
        c.append(i)
c

[3, 4]

In [150]:
import pandas as pd
train = pd.DataFrame(columns=["hotel_id", "user_id", "checkin_date", "checkout_date", "city", "state", "booking_info", "description", "amount_spent"])

train = train.append({"hotel_id" : "H0001", "user_id" : "U0001", "booking_info" : {"Age" : [30, 10, 28], "Gender" : ["M", "F", "M"]}, "checkin_date" : "2020-05-01","checkout_date" : "2020-05-02", "city" : "Bangalore", "state" : "Karnataka","description" : "We have one of the largest infinity swimming pool in bangalore with other facilities like spa, gamezone etc","amount_spent" : 1200}, ignore_index=True)

train = train.append({"hotel_id" : "H0002", "user_id" : "U0001", "booking_info" : {"Age" : [30, 28], "Gender" : ["M", "F"]}, "checkin_date" : "2021-01-01","checkout_date" : "2021-01-03", "city" : "Mysore", "state" : "Karnataka","description" : "Free breakfast with welcome drink and airport pickup/drop facility. Get access to one of the largest casino in india. We have the largest pool table.",
"amount_spent" : 2000}, ignore_index=True)
train = train.append({"hotel_id" : "H0001", "user_id" : "U0002", "booking_info" : {"Age" : [30], "Gender" : ["M"]}, "checkin_date" : "2020-08-10","checkout_date" : "2020-08-10", "city" : "Banglore", "state" : "Karnataka","description" : "We have one of the largest infinity swimming pool in bangalore with other facilities like spa, gamezone etc",
"amount_spent" : 1000}, ignore_index=True)

In [151]:
train

,hotel_id,user_id,checkin_date,checkout_date,city,state,booking_info,description,amount_spent
0,H0001,U0001,2020-05-01,2020-05-02,Bangalore,Karnataka,"{'Age': [30, 10, 28], 'Gender': ['M', 'F', 'M']}",We have one of the largest infinity swimming p...,1200
1,H0002,U0001,2021-01-01,2021-01-03,Mysore,Karnataka,"{'Age': [30, 28], 'Gender': ['M', 'F']}",Free breakfast with welcome drink and airport ...,2000
2,H0001,U0002,2020-08-10,2020-08-10,Banglore,Karnataka,"{'Age': [30], 'Gender': ['M']}",We have one of the largest infinity swimming p...,1000

In [152]:
train[['checkin_y','checkin_m','checkin_d']] = train.checkin_date.str.split('-')

In [153]:
train

,hotel_id,user_id,checkin_date,checkout_date,city,state,booking_info,description,amount_spent,checkin_y,checkin_m,checkin_d
0,H0001,U0001,2020-05-01,2020-05-02,Bangalore,Karnataka,"{'Age': [30, 10, 28], 'Gender': ['M', 'F', 'M']}",We have one of the largest infinity swimming p...,1200,2020,2021,2020
1,H0002,U0001,2021-01-01,2021-01-03,Mysore,Karnataka,"{'Age': [30, 28], 'Gender': ['M', 'F']}",Free breakfast with welcome drink and airport ...,2000,05,01,08
2,H0001,U0002,2020-08-10,2020-08-10,Banglore,Karnataka,"{'Age': [30], 'Gender': ['M']}",We have one of the largest infinity swimming p...,1000,01,01,10

In [154]:
train[['checkout_y','checkout_m','checkout_d']] = train.checkout_date.str.split('-')

In [155]:
train

,hotel_id,user_id,checkin_date,checkout_date,city,state,booking_info,description,amount_spent,checkin_y,checkin_m,checkin_d,checkout_y,checkout_m,checkout_d
0,H0001,U0001,2020-05-01,2020-05-02,Bangalore,Karnataka,"{'Age': [30, 10, 28], 'Gender': ['M', 'F', 'M']}",We have one of the largest infinity swimming p...,1200,2020,2021,2020,2020,2021,2020
1,H0002,U0001,2021-01-01,2021-01-03,Mysore,Karnataka,"{'Age': [30, 28], 'Gender': ['M', 'F']}",Free breakfast with welcome drink and airport ...,2000,05,01,08,05,01,08
2,H0001,U0002,2020-08-10,2020-08-10,Banglore,Karnataka,"{'Age': [30], 'Gender': ['M']}",We have one of the largest infinity swimming p...,1000,01,01,10,02,03,10

In [159]:
train['swimmingpool'] = np.where(train.description.str.contains("swimming pool"),1,0)

In [160]:
train

,hotel_id,user_id,checkin_date,checkout_date,city,state,booking_info,description,amount_spent,checkin_y,checkin_m,checkin_d,checkout_y,checkout_m,checkout_d,swimmingpool
0,H0001,U0001,2020-05-01,2020-05-02,Bangalore,Karnataka,"{'Age': [30, 10, 28], 'Gender': ['M', 'F', 'M']}",We have one of the largest infinity swimming p...,1200,2020,2021,2020,2020,2021,2020,1
1,H0002,U0001,2021-01-01,2021-01-03,Mysore,Karnataka,"{'Age': [30, 28], 'Gender': ['M', 'F']}",Free breakfast with welcome drink and airport ...,2000,05,01,08,05,01,08,0
2,H0001,U0002,2020-08-10,2020-08-10,Banglore,Karnataka,"{'Age': [30], 'Gender': ['M']}",We have one of the largest infinity swimming p...,1000,01,01,10,02,03,10,1

In [161]:
train['drink'] = np.where(train.description.str.contains("drink"),1,0)

In [162]:
train

,hotel_id,user_id,checkin_date,checkout_date,city,state,booking_info,description,amount_spent,checkin_y,checkin_m,checkin_d,checkout_y,checkout_m,checkout_d,swimmingpool,drink
0,H0001,U0001,2020-05-01,2020-05-02,Bangalore,Karnataka,"{'Age': [30, 10, 28], 'Gender': ['M', 'F', 'M']}",We have one of the largest infinity swimming p...,1200,2020,2021,2020,2020,2021,2020,1,0
1,H0002,U0001,2021-01-01,2021-01-03,Mysore,Karnataka,"{'Age': [30, 28], 'Gender': ['M', 'F']}",Free breakfast with welcome drink and airport ...,2000,05,01,08,05,01,08,0,1
2,H0001,U0002,2020-08-10,2020-08-10,Banglore,Karnataka,"{'Age': [30], 'Gender': ['M']}",We have one of the largest infinity swimming p...,1000,01,01,10,02,03,10,1,0

In [167]:
## print duplicates

s = "Python is great and Java is also great"

l = s.split(" ")
l
m = []

for i in l:
    if (s.count(i)>1) and (i not in m):
        m.append(i)
m

['is', 'great']